DELETE FROM user_role;
DELETE FROM meals;
DELETE FROM users;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password)
VALUES ('User', 'user@yandex.ru', 'password'),
       ('Admin', 'admin@gmail.com', 'admin'),
       ('Guest', 'guest@gmail.com', 'guest');

INSERT INTO user_role (role, user_id)
VALUES ('USER', 100000),
       ('ADMIN', 100001);

INSERT INTO meals (date_time, description, calories, user_id)
VALUES ('2020-01-30 11:00:00', 'Завтрак админа', 400, 100001),
       ('2020-01-30 13:00:00', 'обед админа', 900, 100001),
       ('2020-01-30 18:00:00', 'ужин админа', 800, 100001),
       ('2020-01-31 10:00:00', 'Завтрак админа', 200, 100001),
       ('2020-01-31 13:00:00', 'Обед админа', 700, 100001),
       ('2020-01-31 19:00:00', 'Ужин админа', 700, 100001),
       ('2020-02-01 09:00:00', 'Вкусный завтрак админа', 400, 100001),
       ('2020-02-01 14:00:00', 'Сытный обед админа', 1200, 100001),
       ('2020-02-01 20:00:00', 'Горячий ужин админа', 700, 100001),
       ('2020-01-30 11:00:00', 'Тост с яицом и лососем (завтрак)', 400, 100000),
       ('2020-01-30 13:00:00', 'Фуагра с говядиной под брусничным соусом (обед)', 900, 100000),
       ('2020-01-30 18:00:00', 'Сырный суп с чесночными гренками (ужин)', 568, 100000),
       ('2020-01-31 10:00:00', 'Фрктовый салат (завтрак)', 575, 100000),
       ('2020-01-31 13:00:00', 'Гречка с кольмаром (обед)', 890, 100000),
       ('2020-01-31 19:00:00', 'Белая рыба в меду (ужин)', 660, 100000),
       ('2020-02-01 09:00:00', 'Детокс-салат и смузи из сельдееря (завтрак)', 1, 100000),
       ('2020-02-01 14:00:00', 'Авокадо с форелью (обед)', 165, 100000),
       ('2020-02-01 20:00:00', 'Греческий йогурт (ужин)', 50, 100000)
